FKDD_COPY_DIFF_3_2026-02-13/Catalogs/KPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>KPI</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорияKPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидРасчетаKPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельнаяЧасть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размерность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Размерность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниСбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаПостобработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПоСдельнымНарядам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляОтдельнойЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обратный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебноеНаименеование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетПлана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаДляРасчетаПремии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаДляРасчетаПлановойПремии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОграничиватьВРасчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетПереодическоеОписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднееЗаКвартал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговоеЗначенияДляРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьДоЦелых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговоеЗначенияДляРасчетаНеМенее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательСуммаКМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиДляРасчетаМотивации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательКоэффициентПремирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыНастройкиKPI</v8:Type>
						<v8:Type>cfg:CatalogRef.ПоказателиДляРасчетаМотивации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КоэффициентыБазовойЧастиОтВыполненияПлана</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполненияПлана</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиДляРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KPI</v8:Type>
								<v8:Type>cfg:CatalogRef.ПараметрыНастройкиKPI</v8:Type>
								<v8:Type>cfg:CatalogRef.ПоказателиДляРасчетаМотивации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переменная</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ПоказателиДляРасчетаМотивации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПоказателиДляРасчетаМотивации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйМодуль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникПоказателяKPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетДетализацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодульРасшифровки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перезаписывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяКоэффициентомФактическогоВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыЗапросаХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпцияОбрабатывать__</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыРасшифровкиХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеременныеСерверХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйМодульРасшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрезПоследнегоЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВыражение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Список</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСписок</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИтоговыеКолонки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Колонка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Осн</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/KPI/Forms/ФормаПроверкаФормулы/Ext/Form/Module.bsl
&НаКлиенте
Процедура Проверить(Команда)
	
	ТекстОшибки="";
	Если ИмяКоманды = "Расчет" Тогда
		
		ЗначKPI = Справочники.KPI.РасчитатьKPI(Период.ДатаНачала,КонецДня(Период.ДатаОкончания),Сотрудник, Сотрудник.Должность, ТекущийKPI, ТекстОшибки);
		
	ИначеЕсли ИмяКоманды = "Премия" 
		ИЛИ ИмяКоманды = "ПлановаяПремия" Тогда
		
		ЗначKPI = Справочники.KPI.РасчитатьKPI(Период.ДатаНачала,КонецДня(Период.ДатаОкончания),Сотрудник, Сотрудник.Должность, ТекущийKPI,ТекстОшибки,,истина,ПланФакт);
		
	ИначеЕсли ИмяКоманды = "ПостОбработка" Тогда
		
		ЗначKPI = Справочники.KPI.Постобработка(ПланФакт, ТекущийKPI, ТекстОшибки);

	КонецЕсли;
	
	Сообщить(ТекстОшибки+"Значение="+ЗначKPI);

КонецПроцедуры

&НаКлиенте
Процедура Расшифровка(Команда)
	
	ТекстОшибки="";
	
	Если ИмяКоманды = "Расчет" Тогда

		ТекстФ = Справочники.KPI.ПоказатьРасчетKPI(Период.ДатаНачала,КонецДня(Период.ДатаОкончания), Сотрудник, Сотрудник.Должность, ТекущийKPI, ТекстОшибки);
		СпПок = ПолучитьСписокПараметров(ТекущийKPI.Формула);
		СпДоп = ПолучитьСписокДопПараметров(ТекущийKPI.Формула);
	ИначеЕсли ИмяКоманды = "Премия" 
		ИЛИ ИмяКоманды = "ПлановаяПремия" Тогда
		
		ТекстФ = Справочники.KPI.ПоказатьРасчетKPI(Период.ДатаНачала,КонецДня(Период.ДатаОкончания), Сотрудник, Сотрудник.Должность, ТекущийKPI,ТекстОшибки,истина,ПланФакт,Плановая);
		
		Если Плановая тогда
			СпПок = ПолучитьСписокПараметров(ТекущийKPI.ФормулаДляРасчетаПлановойПремии);
			СпДоп = ПолучитьСписокДопПараметров(ТекущийKPI.ФормулаДляРасчетаПлановойПремии);
		Иначе
			СпПок = ПолучитьСписокПараметров(ТекущийKPI.ФормулаДляРасчетаПремии);
			СпДоп = ПолучитьСписокДопПараметров(ТекущийKPI.ФормулаДляРасчетаПремии);
		КонецЕсли;
		
	КонецЕсли;
	
	ТабличныйДокумент=Новый ТабличныйДокумент;
	Макет = Отчеты.ИндивидуальныйЛистРасчета.ПолучитьМакет("РасшифровкаПоказателя");
	Обл = Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.Показатель=ТекущийKPI;
	Обл.Параметры.Формула=ТекстФ;
	
	ТабличныйДокумент.Вывести(Обл);
	Для Каждого ТекЭл из СпПок Цикл
		Обл=Макет.ПолучитьОбласть("Показатель");
		Обл.Параметры.Показатель=ТекЭл.Значение;
		Обл.Параметры.ЕстьРасшифровка="Расшифровка:"+ТекЭл.Значение.ИмеетДетализацию;
		ТабличныйДокумент.Вывести(Обл);
		Если  ТекЭл.Значение.ИмеетДетализацию Тогда
			Об = ТекЭл.Значение.ПолучитьОбъект();
			ТР = Справочники.ПоказателиДляРасчетаМотивации.Расшифровка(Об, Период.ДатаНачала, КонецДня(Период.ДатаОкончания),Сотрудник);
			Выс = ТабличныйДокумент.ВысотаТаблицы;
			ТабличныйДокумент.Вывести(ТР);
			Для а = 1 по ТР.ВысотаТаблицы цикл
				Для а1 = 1 по ТР.ШиринаТаблицы цикл
					б = а+Выс;
					ТабличныйДокумент.Область("R"+Формат(б,"ЧЦ=6; ЧРД=; ЧРГ=; ЧГ=")+"C"+Формат(а1,"ЧЦ=6; ЧРД=; ЧРГ=; ЧГ=")).ШиринаКолонки=ТР.Область("R"+Формат(а,"ЧЦ=6; ЧРД=; ЧРГ=; ЧГ=")+"C"+Формат(а1,"ЧЦ=6; ЧРД=; ЧРГ=; ЧГ=")).ШиринаКолонки;
				конеццикла;
			конеццикла;
		КонецЕсли;
	КонецЦикла;	
    Для Каждого ТекЭл из СпДоп Цикл
		Обл=Макет.ПолучитьОбласть("Показатель");
		Обл.Параметры.Показатель="Параметр "+ТекЭл.Значение;
		ТабличныйДокумент.Вывести(Обл);
	КонецЦикла;	
	
	ТабличныйДокумент.ОтображатьСетку=Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки=Ложь;
	ТабличныйДокумент.ТолькоПросмотр=Истина;
	ТабличныйДокумент.Показать("Расшифровка "+ТекущийKPI);
    ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПараметров(Знач ТекФормула)
	
	СпПар=Новый СписокЗначений;
	Найден=истина;
	Пока Найден Цикл
		Поз1=Найти(ТекФормула,"[");
		Поз2=Найти(ТекФормула,"]");
		Если Поз1>0 Тогда
			Найден=истина;
			ТекКод=Сред(ТекФормула,Поз1+1,Поз2-Поз1-1);
			ТекФормула=Сред(ТекФормула,Поз2+1);
			Эл=Справочники.ПоказателиДляРасчетаМотивации.НайтиПоКоду(ТекКод,,,);
			Если СпПар.НайтиПоЗначению(Эл)=Неопределено Тогда
				НовЗн=СпПар.Добавить();
				НовЗн.Значение=Эл;
				НовЗН.Представление="["+ТекКод+"]";
			КонецЕсли;
		Иначе
			Найден=ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат  СпПар;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДопПараметров(Знач ТекФормула)
	
	СпПар=Новый СписокЗначений;
	 Найден=истина;
	 Пока Найден Цикл
		 Поз1=Найти(ТекФормула,"ͼ");
		 Поз2=Найти(ТекФормула,"ͽ");
		 Если Поз1>0 Тогда
			 Найден=истина;
			 ТекКод=Сред(ТекФормула,Поз1+1,Поз2-Поз1-1);
			 ТекФормула=Сред(ТекФормула,Поз2+1);
			 Эл=Справочники.ПараметрыНастройкиKPI.НайтиПоКоду(ТекКод,,,);
			 Если СпПар.НайтиПоЗначению(Эл)=Неопределено Тогда
				 НовЗн=СпПар.Добавить();
				 НовЗн.Значение=Эл;
				 НовЗН.Представление="ͼ"+ТекКод+"ͽ";
			 КонецЕсли;
		 Иначе
			 Найден=ложь;
		 КонецЕсли;
	 КонецЦикла;
	 Возврат  СпПар;
 КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.ДатаНачала    = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	Период.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ТекущийKPI = Параметры.ТекущийKPI;
	
	Плановая = Параметры.Плановая;
	
	ИмяКоманды = Параметры.ИмяКоманды;
	Если ИмяКоманды = "Премия" 
		ИЛИ ИмяКоманды = "ПлановаяПремия" Тогда
		 Элементы.ПланФакт.Видимость = Истина;
		 Элементы.Период.Видимость = Истина;
		 Элементы.Сотрудник.Видимость = Истина;
		 Элементы.ФормаРасшифровка.Видимость=Истина;
	 ИначеЕсли ИмяКоманды = "ПостОбработка" Тогда
		 Элементы.ПланФакт.Видимость = Истина;
		 Элементы.Период.Видимость = Ложь;
		 Элементы.Сотрудник.Видимость = Ложь;
		 Элементы.ФормаРасшифровка.Видимость=Ложь;
	Иначе	 
		 Элементы.ПланФакт.Видимость = Ложь;
		 Элементы.Период.Видимость = Истина;
		 Элементы.Сотрудник.Видимость = Истина;
		 Элементы.ФормаРасшифровка.Видимость=Истина;
	КонецЕсли;	
		
КонецПроцедуры
